package org.hw5;

public class Exemple5 {
    public static void main(String[] args) {

    }



    /** 2. Пусть дан список сотрудников:
     Написать программу, которая найдет и выведет повторяющиеся имена с количеством повторений.
     Отсортировать по убыванию популярности.

     Иван Иванов
     Светлана Петрова
     Кристина Белова
     Анна Мусина
     Анна Крутова
     Иван Юрин
     Петр Лыков
     Павел Чернов
     Петр Чернышов
     Мария Федорова
     Марина Светлова
     Мария Савина
     Мария Рыкова
     Марина Лугова
     Анна Владимирова
     Иван Мечников
     Петр Петин
     Иван Ежов

     3. Реализовать алгоритм пирамидальной сортировки (HeapSort).
     4.(дополнительно) На шахматной доске расставить 8 ферзей так, чтобы они не били друг друга.
     */
}
