package org.hw4;

public class Exempl4 {
    public static void main(String[] args) {

    }
    /**
     * 1. Пусть дан LinkedList с несколькими элементами. Реализуйте метод, который вернет “перевернутый” список.
     * 2. Реализуйте очередь с помощью LinkedList со следующими методами:enqueue() - помещает элемент в конец очереди, dequeue() - возвращает первый элемент из очереди и удаляет его, first() - возвращает первый элемент из очереди, не удаляя.
     * 3. В калькулятор добавьте возможность отменить последнюю операцию.
     */
}
